[
    {
        "id": 1,
        "name": "Code Quiz",
        "image": "code_quiz.png",
        "description": "This was a homework assignment in CWRU Coding Bootcamp. The task for this homework was to create a single page quizzing app that displays questions and answers from an array, keep score, display user score and store all-time scores in local storage. More information is on the linked GitHub.",
        "deployed_link": "https://michaelolshewski.github.io/CWCodeQuiz/",
        "repo_link": "https://github.com/MichaelOlshewski/CWCodeQuiz",
        "alt_text": "Image of JavaScript Code Quiz"
    },
    {
        "id": 2,
        "name": "Password Generator",
        "image": "password_gen.png",
        "description": "This was a homework assignment in CWRU Coding Bootcamp. The task for this homework was to create an app that the user can select certain requirements for a password, generate a really weak or really strong password based on their selections. More information is on the linked GitHub.",
        "deployed_link": "https://michaelolshewski.github.io/CWRandomPasswordGen/",
        "repo_link": "https://github.com/MichaelOlshewski/CWRandomPasswordGen",
        "alt_text": "Image of Password Generator"
    },
    {
        "id": 3,
        "name": "Dinner & A Show",
        "image": "dinner_and_a_show.png",
        "description": "This was a group project in CWRU Coding Bootcamp. We had to select a total of three different APIs that we had not worked with in previous homework assignments or in class activities. Our idea was creat an app that a busy person can select a specific city of an event, and be able to see and choose local cuisines that are ordered closest to farthest based on the events latitude and longitude. More information is on the linked GitHub.",
        "deployed_link": "https://michaelolshewski.github.io/Dinner_and_a_show/",
        "repo_link": "https://github.com/MichaelOlshewski/Dinner_and_a_show",
        "alt_text": "Image of Group Project 'Dinner And A Show'."
    },
    {
        "id": 4,
        "name": "Eat-Da-Burger",
        "image": "eat-da-burger.png",
        "description": "This was a homework assignment in CWRU Coding Bootcamp. This homework's task was to create an application that you can add any burger that would like to eat and keep track of any that you have ate already. I utilized HTML, CSS, Bootstrap, JavaScript, Handlebars for the front-end, and utilized Express, Express-Router, MySQL, a custom ORM and Node.JS with Nodemon. This application was built completely from scratch from building the basic html pages to setting up the server, route handling, setting up the MVC, and handling CRUD events to and from the MySQL database and finally uploading on Heroku.",
        "deployed_link": "https://michaelolshewski.github.io/CWCodeQuiz/",
        "repo_link": "https://github.com/MichaelOlshewski/CWCodeQuiz",
        "alt_text": "Image of Eat-Da-Burger"
    },
    {
        "id": 5,
        "name": "Bookmarquis",
        "image": "bookmarquis.png",
        "description": "This was a group project in the CWRU Coding Boot Camp. We had to choose a application idea that we would find useful and we deciding on a bookmarking application. It was an extensive project, between utilizing Heroku, Node, Express, MySQL, Databases, Handlebars and having to implement a few different API's, we definitely had our work cut out for us. Our team are very proud of this application, We have other stretch goals we would like to add and we will continue to work on this to achieve those goals.",
        "deployed_link": "https://michaelolshewski.github.io/CWCodeQuiz/",
        "repo_link": "https://github.com/MichaelOlshewski/CWCodeQuiz",
        "alt_text": "Image of BookMarquis Project"
    },
    {
        "id": 6,
        "name": "Portfolio Management System",
        "image": "pms.png",
        "description": "This was a homework assignment in CWRU Coding Bootcamp. The task for this homework was to create a single page quizzing app that displays questions and answers from an array, keep score, display user score and store all-time scores in local storage. More information is on the linked GitHub.",
        "deployed": "portmansys.herokuapp.com",
        "repository": "https://github.com/MichaelOlshewski/PortfolioManagementSystem",
        "alt_text": "Image of the Portfolio Management System"
    }
]